snlkuharlocal/src/DataProcessors/ПланИнвентаризации/ПланИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПланИнвентаризации</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/БлокировкаВыдачиВНабор/БлокировкаВыдачиВНабор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БлокировкаВыдачиВНабор</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/БлокировкаВыдачиВНабор/БлокировкаВыдачиВНабор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БлокировкаВыдачиВНабор</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <registerRecords>InformationRegister.БлокировкаВыдачиВНабор</registerRecords>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Инвентаризация</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаБлокировкиFBS</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаткиFBSОбнулены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяДействия</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СостоянияЗапрета</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СостоянияРезервирования</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗНБ</name>
    <attributes>
      <name>ЗаданиеНабора</name>
      <type>
        <types>DocumentRef.ЗаданиеНабора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ПланИнвентаризации/ManagerModule.bsl
Функция ПроверитьДокументНаОтсутствиеБлокировок(Знач Документ)  Экспорт
	РезПроверки = Новый Структура("Успех,Ошибки,ДопТекстОшибки",истина, Новый Массив,""); 
	Запрос = Новый Запрос; 
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаданиеНабора") Тогда 
		//Данилова Е.В. 11.03.2026 SNL-159  изменение запроса с учетом проходных накладных
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
		|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
		|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
		|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
		|ПОМЕСТИТЬ ВТБлокировки
		|ИЗ
		|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
		|			&ТекущаяДата,
		|			Склад = &Склад
		|				ИЛИ Склад = &СкладФизСклад) КАК БлокировкаВыдачиВНаборСрезПоследних
		|ГДЕ
		|	БлокировкаВыдачиВНаборСрезПоследних.Активен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТЗНБВНаборе
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
		|		ПО ЗаданиеНабора.ДокументОснование = ПланНабора.Ссылка
		|ГДЕ
		|	ПланНабора.ПроходнаяНакладная
		|	И ПланНабора.Ссылка = &ПланНабора
		|	И ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.СостояниеНакладной В(&СостоянияВНаборе)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНабора.Склад КАК Склад,
		|	ЗаданиеНабора.Ссылка КАК Ссылка,
		|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТНоменклатураЗНБОстальные
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
		|		ПО ЗаданиеНабора.ДокументОснование = ПланНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|		ПО ЗаданиеНабора.Ссылка = ЗаданиеНабораТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗНБВНаборе КАК ВТЗНБВНаборе
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ПланНабора.ПроходнаяНакладная
		|	И ПланНабора.Ссылка = &ПланНабора
		|	И ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.СостояниеНакладной В(&СостоянияДоОжиданияНабора)
		|	И ВТЗНБВНаборе.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНабора.Склад КАК Склад,
		|	ЗаданиеНабора.Ссылка КАК Ссылка,
		|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТоварыДокумента
		|ИЗ
		|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
		|		ПО (ЗаданиеНабора.ДокументОснование = ПланНабора.Ссылка)
		|ГДЕ
		|	ЗаданиеНабора.Ссылка = &Ссылка
		|	И НЕ ПланНабора.ПроходнаяНакладная
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТНоменклатураЗНБОстальные.Склад,
		|	ВТНоменклатураЗНБОстальные.Ссылка,
		|	ВТНоменклатураЗНБОстальные.Номенклатура
		|ИЗ
		|	ВТНоменклатураЗНБОстальные КАК ВТНоменклатураЗНБОстальные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТоварыДокумента.Ссылка КАК Ссылка,
		|	ВТТоварыДокумента.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТТоварыДокумента КАК ВТТоварыДокумента
		|ГДЕ
		|	(ВТТоварыДокумента.Склад В
		|				(ВЫБРАТЬ
		|					ВТБлокировки.Склад
		|				ИЗ
		|					ВТБлокировки)
		|			ИЛИ ВТТоварыДокумента.Склад.ФизическийСклад В
		|				(ВЫБРАТЬ
		|					ВТБлокировки.Склад
		|				ИЗ
		|					ВТБлокировки))
		|	И ВТТоварыДокумента.Номенклатура В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТБлокировки.Номенклатура
		|			ИЗ
		|				ВТБлокировки)";
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("Склад", Документ.Склад);
		Запрос.УстановитьПараметр("СкладФизСклад", Документ.Склад.ФизическийСклад); 
		//++Данилова Е.В. 11.03.2026 SNL-159 
		Запрос.УстановитьПараметр("ПланНабора", Документ.ДокументОснование);
		
		СостоянияДоОжиданияНабора = Новый Массив;
		СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.ПолученоСкладом); 
		СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.СформированыЗаданияНабора);
		СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.ПроверенаПоОстаткам);
		
		Запрос.УстановитьПараметр("СостоянияДоОжиданияНабора", СостоянияДоОжиданияНабора);
		
		СостоянияВНаборе = Новый Массив;
		СостоянияВНаборе.Добавить(перечисления.СостоянияНакладной.ОжиданиеНабора); 
		СостоянияВНаборе.Добавить(перечисления.СостоянияНакладной.ВНаборе);
		Запрос.УстановитьПараметр("СостоянияВНаборе", СостоянияВНаборе);
		//--Данилова Е.В. 11.03.2026 
	Иначе
		Возврат РезПроверки; 
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	РезПроверки.Успех =  РезультатЗапроса.Пустой();
	//++Данилова Е.В. 11.03.2026 SNL-159
	ПроходнаяНакладная = ПолучитьРеквизитШапки(Документ.ДокументОснование,"ПроходнаяНакладная"); 
	Если  ПроходнаяНакладная
		И НЕ РезультатЗапроса.Пустой() Тогда
		МассивТоваровБлок = Новый Массив; 
		МассивЗНБ = Новый Массив; 
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если МассивТоваровБлок.Найти(Выборка.Номенклатура) = Неопределено Тогда
				
				МассивТоваровБлок.Добавить(Выборка.Номенклатура);	
				
			КонецЕсли; 
			
			Если МассивЗНБ.Найти(Выборка.ссылка) = Неопределено Тогда
				
				МассивЗНБ.Добавить(Выборка.ссылка);	
				
			КонецЕсли; 
			
		КонецЦикла;
		РезПроверки.Ошибки = МассивТоваровБлок;
		РезПроверки.ДопТекстОшибки = "Проходная накладная!!! Заблокированные товары по ЗНБ:" + СтрСоединить(МассивЗНБ,",");
		
		Возврат РезПроверки;
	Иначе 
		
		
		МассивТоваровБлок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");  
		РезПроверки.Ошибки = МассивТоваровБлок; 
		
		Возврат РезПроверки;
	КонецЕсли;
	//--Данилова Е.В. 11.03.2026
КонецФункции // ПроверитьДокументНаНаличиеБлокировок()

Функция ПроверитьВозможностьЗаполненияИНВ(ДокОбъект,МассивТоваров,МассивСкладов) ЭКСПОРТ
	МассивОшибок  = Новый Массив; 
	ЗНБИсключения = новый Массив; 
	
	РезультатОтработки = новый Структура("Успех,Ошибки,Данные",Истина,Новый Массив, новый Массив); 
	Если ДокОбъект.Метаданные().Имя = "Инвентаризация" Тогда
		Если ДокОбъект.СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе Тогда
			
			МассивОшибок.Добавить("Заполнять остатки можно только в состоянии ""в работе"" "); 	
			РезультатОтработки.Успех = Ложь; 
			РезультатОтработки.ошибки = МассивОшибок; 
			Возврат РезультатОтработки; 
		КонецЕсли; 		
	КонецЕсли;   	 
	
	//ЕстьБлокировка = ЕстьблокировкаПоИНВ(МассивСкладов,МассивТоваров);
	//
	//Если НЕ ЕстьБлокировка Тогда
	//	
	//	МассивОшибок.Добавить("Для работы с инвентаризацией необходимо создать документ блокировки! Активной блокировки не найдено!"); 	
	//	РезультатОтработки.Успех = Ложь; 
	//	РезультатОтработки.ошибки = МассивОшибок;
	//	
	//	Возврат РезультатОтработки; 
	//	
	//КонецЕсли;
	//++Данилова Е.В. 12.02.2026 по письму 
	Индекс = МассивСкладов.Найти(Справочники.Склады.ПустаяСсылка()); 
	Если Индекс <> неопределено Тогда
	
		МассивСкладов.Удалить(Индекс); 	
	
	КонецЕсли;
	//--Данилова Е.В. 12.02.2026  
	
	//Данилова Е.В. 11.03.2026 SNL-159 
	//изменение запроса с учетом проходных накладных 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(Склады.Ссылка В ИЕРАРХИИ (&Склады)
	|			ИЛИ Склады.ФизическийСклад В ИЕРАРХИИ (&Склады))
	|	И НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.Ссылка = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
	|	И НЕ Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБПомежуточная
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТовары.Ссылка
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК ПланНабора,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.СостояниеНакладной КАК СостояниеНакладной
	|ПОМЕСТИТЬ ВТЗаблокированныеТоварыПоПроходнаяНакладная
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
	|		ПО (ПланНабора.ПроходнаяНакладная)
	|			И (ЗаданиеНабора.ДокументОснование = ПланНабора.Ссылка)
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияПроверкиЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТовары.Ссылка
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная.Склад КАК Склад,
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная.Номенклатура КАК Номенклатура,
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная.ЗНБ КАК ЗНБПроходная
	|ПОМЕСТИТЬ ВТАктивныеЗНБ
	|ИЗ
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная КАК ВТЗаблокированныеТоварыПоПроходнаяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабораДокумент
	|		ПО ВТЗаблокированныеТоварыПоПроходнаяНакладная.ПланНабора = ПланНабораДокумент.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|		ПО (ПланНабораДокумент.Ссылка = ЗаданиеНабора.ДокументОснование)
	|			И (ЗаданиеНабора.СостояниеНакладной В (&СостоянияПроверкиЗНБ))
	|			И (ЗаданиеНабора.Проведен)
	|			И (ЗаданиеНабора.Ссылка <> ВТЗаблокированныеТоварыПоПроходнаяНакладная.ЗНБ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктивныеЗНБПомежуточная КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = ЗаданиеНабора.Ссылка)
	|ГДЕ
	|	ВТАктивныеЗНБ.ЗНБ ЕСТЬ NULL
	|	И (ЗаданиеНабора.СостояниеНакладной В (&СостоянияЗНБ)
	|			ИЛИ ВТЗаблокированныеТоварыПоПроходнаяНакладная.СостояниеНакладной В (&СостоянияЗНБ))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАктивныеЗНБ.ЗНБ,
	|	ВТАктивныеЗНБ.Склад,
	|	ВТАктивныеЗНБ.Номенклатура,
	|	ВТАктивныеЗНБ.ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБПомежуточная КАК ВТАктивныеЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
	|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад
	|ПОМЕСТИТЬ ВТБлокировкиВсе
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
	|			,
	|			Склад В
	|				(ВЫБРАТЬ
	|					ВТСклады.Ссылка
	|				ИЗ
	|					ВТСклады)) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора КАК ЗНБ,
	|	БлокировкаВыдачиВНаборЗНБ.Ссылка КАК Блокировка
	|ПОМЕСТИТЬ ВТБлокировкиПоЗНБ
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
	|			&Текущаядата,
	|			Склад В
	|				(ВЫБРАТЬ
	|					ВТСклады.Ссылка
	|				ИЗ
	|					ВТСклады)) КАК БлокировкаВыдачиВНаборСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
	|		ПО БлокировкаВыдачиВНаборСрезПоследних.Регистратор = БлокировкаВыдачиВНаборЗНБ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора)
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТБлокировкиПоЗНБ.Блокировка КАК Блокировка,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБВБлокировках
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	НЕ ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура,
	|	ВТАктивныеЗНБ.ЗНБПроходная КАК ЗНБПроходная
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|ИТОГИ ПО
	|	ЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБВБлокировках.ЗНБ КАК ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБлокировкиВсе.Блокировка КАК Блокировка,
	|	ВТБлокировкиВсе.Склад КАК Склад
	|ИЗ
	|	ВТБлокировкиВсе КАК ВТБлокировкиВсе";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", МассивТоваров); //Номенклатура.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склады", МассивСкладов); //Склады.ВыгрузитьКолонку("Склад"));
	СостоянияЗНБ = Новый Массив; 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	Запрос.УстановитьПараметр("СостоянияЗНБ", СостоянияЗНБ);
	Запрос.УстановитьПараметр("Отгружена", Перечисления.СостоянияНакладной.Отгружена);
	//++Данилова Е.В. 11.03.2026 SNL-159  
	СостоянияДоОжиданияНабора = Новый Массив;
	СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.ПолученоСкладом); 
	СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.СформированыЗаданияНабора);
	СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.ПроверенаПоОстаткам);
	 
	Запрос.УстановитьПараметр("СостоянияДоОжиданияНабора", СостоянияДоОжиданияНабора);
	
	СостоянияПроверкиЗНБ = Новый Массив; 
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом); 
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.СформированыЗаданияНабора);
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ПроверенаПоОстаткам);
	Запрос.УстановитьПараметр("СостоянияПроверкиЗНБ", СостоянияПроверкиЗНБ);
	
	//--Данилова Е.В. 11.03.2026
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	
	МенеджерВременнныхТаблиц = запрос.МенеджерВременныхТаблиц; 
	
	ВыборкаАктЗНБ = ПакетЗапросов[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаЗНБ = ПакетЗапросов[9].Выбрать(); 
	
	ТЗБлокировки = ПакетЗапросов[10].Выгрузить();
	
	Пока ВыборкаАктЗНБ.Следующий() Цикл
		
		//здесь надо еще проверить по складу 
		МассивТоваров =Новый массив; 
		//++Данилова Е.В. 11.03.2026  SNL-159
		МассивЗНБПроходные = Новый Массив; 
		//--Данилова Е.В. 11.03.2026
		Выборка =  ВыборкаАктЗНБ.выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			//++Данилова Е.В. 11.03.2026  SNL-159
			//МассивТоваров.Добавить(выборка.Номенклатура);
			Если МассивТоваров.Найти(выборка.Номенклатура) = Неопределено Тогда
				
				МассивТоваров.Добавить(выборка.Номенклатура);	
				
			КонецЕсли;
			Если Выборка.ЗНБ <> Выборка.ЗНБПроходная
				И МассивЗНБПроходные.Найти(Выборка.ЗНБПроходная) = Неопределено Тогда
				
				МассивЗНБПроходные.Добавить(Выборка.ЗНБПроходная); 	
				
			КонецЕсли;
			//--Данилова Е.В. 11.03.2026 
		КонецЦикла; 
		//++Данилова Е.В. 11.03.2026  SNL-159 
		ТекстЗНБПроходные = ""; 
		Если МассивЗНБПроходные.Количество() > 0  Тогда
		
			ТекстЗНБПроходные = " Проходная РНК, блокировка в ЗНБ:" + СтрСоединить(МассивЗНБПроходные,","); 	
		
		КонецЕсли; 
		МассивОшибок.Добавить("Активная ЗНБ " + Строка(ВыборкаАктЗНБ.ЗНБ) + Символы.ПС + "Товары:" + СтрСоединить(МассивТоваров,Символы.ПС) + ТекстЗНБПроходные);
		//--Данилова Е.В. 11.03.2026 
		//Для каждого СтрокаТЧ Из ТЗБлокировки Цикл
		//	Если СтрокаТЧ.Склад = ВыборкаАКтЗНБ.ЗНБ.Склад 
		//		ИЛИ СтрокаТЧ.Склад = ВыборкаАКтЗНБ.ЗНБ.Склад.ФизическийСклад Тогда	
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	БлокировкаВыдачиВНаборНоменклатура.Номенклатура КАК Номенклатура
		//		|ПОМЕСТИТЬ ВТБлокТовары
		//		|ИЗ
		//		|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК БлокировкаВыдачиВНаборНоменклатура
		//		|ГДЕ
		//		|	БлокировкаВыдачиВНаборНоменклатура.Ссылка = &Ссылка
		//		|;
		//		|
		//		|////////////////////////////////////////////////////////////////////////////////
		//		|ВЫБРАТЬ
		//		|	Спр.Ссылка КАК Ссылка
		//		|ИЗ
		//		|	Справочник.Номенклатура КАК Спр
		//		|ГДЕ
		//		|	Спр.Ссылка В(&МассивТоваров)
		//		|	И Спр.Ссылка В ИЕРАРХИИ
		//		|			(ВЫБРАТЬ
		//		|				ВТБлокТовары.Номенклатура
		//		|			ИЗ
		//		|				ВТБлокТовары)";
		//		
		//		Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
		//		Запрос.УстановитьПараметр("Ссылка", СтрокаТЧ.Блокировка);
		//		
		//		РезультатЗапроса = Запрос.Выполнить();
		//		
		//		Если  Не РезультатЗапроса.Пустой() Тогда
		//			
		//			МассивОшибок.Добавить("Активная ЗНБ " + Строка(ВыборкаАктЗНБ.ЗНБ) + Символы.ПС + "Товары:" + СтрСоединить(МассивТоваров,Символы.ПС));	
		//			
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;   	
		// 
		
	КонецЦикла;
	 
	 Пока ВыборкаЗНБ.Следующий() Цикл
	 
		 
		 Запрос = Новый Запрос; 
		 Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
		 Запрос.Текст = 
		 
		 "ВЫБРАТЬ
		 |	ВТАктивныеЗНБВБлокировках.Блокировка КАК Блокировка
		 |ПОМЕСТИТЬ ВТБлокировкиПОЗНБ1
		 |ИЗ
		 |	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		 |ГДЕ
		 |	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ТоварыБлок.Номенклатура КАК Номенклатура
		 |ПОМЕСТИТЬ ВТТоварыБлокировки
		 |ИЗ
		 |	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК ТоварыБлок
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировкиПОЗНБ1 КАК ВТБлокировкиПОЗНБ
		 |		ПО (ВТБлокировкиПОЗНБ.Блокировка = ТоварыБлок.Ссылка)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ РАЗЛИЧНЫЕ
		 |	ВТАктивныеЗНБВБлокировках.номенклатура КАК номенклатура
		 |ИЗ
		 |	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		 |ГДЕ
		 |	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		 |	И НЕ ВТАктивныеЗНБВБлокировках.номенклатура В ИЕРАРХИИ
		 |				(ВЫБРАТЬ
		 |					ВТТоварыБлокировки.Номенклатура
		 |				ИЗ
		 |					ВТТоварыБлокировки)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |УНИЧТОЖИТЬ ВТБлокировкиПОЗНБ1
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |УНИЧТОЖИТЬ ВТТоварыБлокировки"; 
		 
		 Запрос.УстановитьПараметр("ЗНБ",ВыборкаЗНБ.ЗНБ); 
		 МассивТоваров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("номенклатура"); 
		 
		 Если МассивТоваров.Количество() > 0   Тогда
			 
			 
			 Для каждого СтрокаТЧ Из ТЗБлокировки Цикл
				 Если СтрокаТЧ.Склад = ВыборкаЗНБ.ЗНБ.Склад 
					 ИЛИ СтрокаТЧ.Склад = ВыборкаЗНБ.ЗНБ.Склад.ФизическийСклад Тогда 
					 Запрос = Новый Запрос;
					 Запрос.Текст = 
					 "ВЫБРАТЬ
					 |	БлокировкаВыдачиВНаборНоменклатура.Номенклатура КАК Номенклатура
					 |ПОМЕСТИТЬ ВТБлокТовары
					 |ИЗ
					 |	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК БлокировкаВыдачиВНаборНоменклатура
					 |ГДЕ
					 |	БлокировкаВыдачиВНаборНоменклатура.Ссылка = &Ссылка
					 |;
					 |
					 |////////////////////////////////////////////////////////////////////////////////
					 |ВЫБРАТЬ
					 |	Спр.Ссылка КАК Ссылка
					 |ИЗ
					 |	Справочник.Номенклатура КАК Спр
					 |ГДЕ
					 |	Спр.Ссылка В(&МассивТоваров)
					 |	И Спр.Ссылка В ИЕРАРХИИ
					 |			(ВЫБРАТЬ
					 |				ВТБлокТовары.Номенклатура
					 |			ИЗ
					 |				ВТБлокТовары)";
					 
					 Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
					 Запрос.УстановитьПараметр("Ссылка", СтрокаТЧ.Блокировка);
					 
					 РезультатЗапроса = Запрос.Выполнить();
					 
					 Если  Не РезультатЗапроса.Пустой() Тогда
						 
						 МассивОшибок.Добавить("Активная ЗНБ " + Строка(ВыборкаЗНБ.ЗНБ) + Символы.ПС + "Товары:" + СтрСоединить(МассивТоваров,Символы.ПС));	
						 
					 КонецЕсли;
				 КонецЕсли;
			 КонецЦикла; 			 	
		 Иначе 
			 ЗНБИсключения.Добавить(ВыборкаЗНБ.ЗНБ);
		 КонецЕсли;
		 
		 
	 КонецЦикла;
	
	РезультатОтработки.Успех = МассивОшибок.Количество() = 0; 
	РезультатОтработки.Ошибки = МассивОшибок;  
	РезультатОтработки.Данные = ЗНБИсключения; 
	
	Возврат РезультатОтработки; 
	//Иначе 
	//	Возврат РезультатОтработки; 
	//КонецЕсли;
	
КонецФункции // ПроверитьВозможностьЗаполнения() 

Функция ЕстьблокировкаПоТоварамСклада(Склады,МассивТоваров,ПланНабораЗНБ = неопределено,ОтборПоСостояниямЗНБ = ложь) Экспорт
	Если ТипЗнч(Склады) = Тип("СправочникСсылка.Склады") Тогда 	
		МассивСкладов = Новый Массив; 	
		МассивСкладов.Добавить(Склады);
		Если ЗначениеЗаполнено(Склады.ФизическийСклад) Тогда
			
			МассивСкладов.Добавить(Склады.ФизическийСклад);	
			
		КонецЕсли;

	ИначеЕсли ТипЗнч(Склады) = Тип("Массив") Тогда 
		МассивСкладов = Склады; 
	КонецЕсли;
	//++Данилова Е.В. 11.03.2026 SNL-159 
	Если ПланНабораЗНБ <> неопределено Тогда
		Запрос = Новый Запрос;
		Если ОтборПоСостояниямЗНБ Тогда 
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданиеНабора.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТЗНБВНаборе
			|ИЗ
			|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ВТПН
			|		ПО ЗаданиеНабора.ДокументОснование = ВТПН.Ссылка
			|			И (ВТПН.ПроходнаяНакладная)
			|			И (ВТПН.Ссылка = &ПланНабора)
			|ГДЕ
			|	ЗаданиеНабора.Проведен
			|	И ЗаданиеНабора.СостояниеНакладной В(&СостоянияВНаборе)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Спр.Ссылка КАК Номенклатура
			|ИЗ
			|	Справочник.Номенклатура КАК Спр
			|ГДЕ
			|	Спр.Ссылка В ИЕРАРХИИ(&МассивТоваров)
			|	И НЕ &ПроходнаяНакладная
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданиеНабораТовары.Номенклатура
			|ИЗ
			|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ВТПН
			|		ПО ЗаданиеНабора.ДокументОснование = ВТПН.Ссылка
			|			И (ВТПН.ПроходнаяНакладная)
			|			И (ВТПН.Ссылка = &ПланНабора)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
			|		ПО ЗаданиеНабора.Ссылка = ЗаданиеНабораТовары.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗНБВНаборе КАК ВТЗНБВНаборе
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ЗаданиеНабора.Проведен
			|	И ЗаданиеНабора.СостояниеНакладной В(&СостоянияДоОжиданияНабора)
			|	И ВТЗНБВНаборе.Ссылка ЕСТЬ NULL";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Спр.Ссылка КАК Номенклатура
			|ИЗ
			|	Справочник.Номенклатура КАК Спр
			|ГДЕ
			|	Спр.Ссылка В ИЕРАРХИИ(&МассивТоваров)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РасходнаяНакладнаяТовары.Номенклатура
			|ИЗ
			|	Документ.%РасходнаяНакладная% КАК РасходнаяНакладная
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ВТПН
			|		ПО РасходнаяНакладная.ссылка = ВТПН.Накладная
			|			И (ВТПН.ПроходнаяНакладная)
			|			И (ВТПН.Ссылка = &ПланНабора)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%РасходнаяНакладная%.%Товары% КАК РасходнаяНакладнаяТовары
			|		ПО РасходнаяНакладная.Ссылка = РасходнаяНакладнаяТовары.Ссылка
			|ГДЕ
			|	РасходнаяНакладная.Проведен"; 
			
			Накладная 		= ПланНабораЗНБ.Накладная; 
			ВидНакладной	= ОбщегоНазначения_ПИ.ПолучитьИмяДокумента(Накладная); 
 			ЭтоКомплектация = (ВидНакладной="РасходнаяНакладная" И ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов","Документ")=Истина) или ВидНакладной="Комплектация"; 
			ИмяТЧНакладной=?(ЭтоКомплектация,"Комплектующие","Товары");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"%РасходнаяНакладная%",ВидНакладной);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Товары%",ИмяТЧНакладной);
			
		КонецЕсли;
		Запрос.УстановитьПараметр("ПланНабора", ПланНабораЗНБ);
		Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
				
		СостоянияДоОжиданияНабора = Новый Массив;
		СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.ПолученоСкладом); 
		СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.СформированыЗаданияНабора);
		СостоянияДоОжиданияНабора.Добавить(перечисления.СостоянияНакладной.ПроверенаПоОстаткам);
		
		Запрос.УстановитьПараметр("СостоянияДоОжиданияНабора", СостоянияДоОжиданияНабора);	
		
		СостоянияВНаборе = Новый Массив;
		СостоянияВНаборе.Добавить(перечисления.СостоянияНакладной.ОжиданиеНабора); 
		СостоянияВНаборе.Добавить(перечисления.СостоянияНакладной.ВНаборе);
		
		Запрос.УстановитьПараметр("СостоянияВНаборе", СостоянияВНаборе);
		Запрос.УстановитьПараметр("ПроходнаяНакладная", ПланНабораЗНБ.ПроходнаяНакладная);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой()  Тогда
			
			МассивТоваров = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 	
		Иначе 
			Возврат Ложь; 
		КонецЕсли;
		
		
	КонецЕсли;
	//--Данилова Е.В. 11.03.2026 
	Запрос = Новый Запрос;
	//++Данилова Е.В. 11.02.2026 HELP-8837 
	запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	//--Данилова Е.В. 11.02.2026 
	Запрос.Текст 	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(Склады.Ссылка В (&МассивСкладов)
	|			ИЛИ Склады.ФизическийСклад В (&МассивСкладов))
	|	И НЕ Склады.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТБлокировка
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
	|			&ТекущаяДата,
	|			Склад В
	|				(ВЫБРАТЬ
	|					ВТСклады.Ссылка
	|				ИЗ
	|					ВТСклады)) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Спр
	|ГДЕ
	|	Спр.Ссылка В ИЕРАРХИИ(&МассивТоваров)
	|	И Спр.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТБлокировка.Номенклатура
	|			ИЗ
	|				ВТБлокировка)
	|;
	| 
	//++Данилова Е.В. 11.02.2026  HELP-8837 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТБлокировка.Регистратор КАК Блокировка
	|ИЗ
	|	ВТБлокировка КАК ВТБлокировка";
	//--Данилова Е.В. 11.02.2026 
	
	запрос.УстановитьПараметр("МассивСкладов",МассивСкладов); 
	запрос.УстановитьПараметр("МассивТоваров",МассивТоваров);
	запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	//++Данилова Е.В. 11.02.2026  HELP-8837
	//результатЗапроса = Запрос.Выполнить();
	//
	//Возврат НЕ результатЗапроса.Пустой(); 
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	РезультатТовары = ПакетЗапросов[2]; 
	РезультатБлокировки = ПакетЗапросов[3];
	МассивТоваровБлокировки =  РезультатТовары.Выгрузить().выгрузитьКолонку("Ссылка"); 
	
	ВыборкаБлокировки =  РезультатБлокировки.Выбрать(); 
	
	Пока ВыборкаБлокировки.Следующий() Цикл
		
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТБлокировка.номенклатура КАК номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлокировки
		|ИЗ
		|	ВТБлокировка КАК ВТБлокировка
		|ГДЕ
		|	ВТБлокировка.Регистратор = &Блокировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНом.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНом
		|ГДЕ
		|	СпрНом.Ссылка В(&МассивТоваров)
		|	И СпрНом.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТТоварыБлокировки.номенклатура
		|			ИЗ
		|				ВТТоварыБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокировки";
		
		Запрос.УстановитьПараметр("Блокировка", ВыборкаБлокировки.Блокировка);
		Запрос.УстановитьПараметр("МассивТоваров", МассивТоваровБлокировки);
		
		ТоварыКонкрБлокировки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка"); 
		
		Если ТоварыКонкрБлокировки.Количество() > 0  Тогда
			
			ТекстСообщения = СтрШаблон("Заблокированы товары, блокировка %1, товары : %2",ВыборкаБлокировки.Блокировка,СтрСоединить(ТоварыКонкрБлокировки,Символы.ПС));  
			Сообщить(ТекстСообщения); 	
		
		КонецЕсли; 
		
		
	КонецЦикла;
	
	
	Возврат  НЕ РезультатТовары.Пустой(); 
	//--Данилова Е.В. 11.02.2026 	

КонецФункции // ЕстьблокировкаПоИНВ()

Функция ПроверитьЗНБОжиданиеНабора(Знач ЗНБ) Экспорт 
	
	РезПроверки = Новый Структура("Успех,Ошибки",истина, Новый Массив);
	Запрос  = новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
		|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
		|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
		|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
		|ПОМЕСТИТЬ ВТБлокировки
		|ИЗ
		|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
		|			&ТекущаяДата,
		|			Склад = &Склад
		|				ИЛИ Склад = &СкладФизСклад) КАК БлокировкаВыдачиВНаборСрезПоследних
		|ГДЕ
		|	БлокировкаВыдачиВНаборСрезПоследних.Активен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНабора.Склад КАК Склад,
		|	ЗаданиеНабора.Ссылка КАК Ссылка,
		|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТоварыДокумента
		|ИЗ
		|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
		|ГДЕ
		|	ЗаданиеНабора.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора КАК ЗаданиеНабора
		|ПОМЕСТИТЬ ВТЗНБ
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировки КАК ВТБлокировки
		|		ПО БлокировкаВыдачиВНаборЗНБ.Ссылка = ВТБлокировки.Блокировка
		|ГДЕ
		|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТоварыДокумента.Ссылка КАК Ссылка,
		|	ВТТоварыДокумента.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТТоварыДокумента КАК ВТТоварыДокумента
		|ГДЕ
		|	(ВТТоварыДокумента.Склад В
		|				(ВЫБРАТЬ
		|					ВТБлокировки.Склад
		|				ИЗ
		|					ВТБлокировки)
		|			ИЛИ ВТТоварыДокумента.Склад.ФизическийСклад В
		|				(ВЫБРАТЬ
		|					ВТБлокировки.Склад
		|				ИЗ
		|					ВТБлокировки))
		|	И ВТТоварыДокумента.Номенклатура В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТБлокировки.Номенклатура
		|			ИЗ
		|				ВТБлокировки)
		|	И ВТТоварыДокумента.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТЗНБ.ЗаданиеНабора
		|			ИЗ
		|				ВТЗНБ)";
                                                      
        Запрос.УстановитьПараметр("Ссылка", ЗНБ);
		Запрос.УстановитьПараметр("Склад", ЗНБ.Склад);
		Запрос.УстановитьПараметр("СкладФизСклад", ЗНБ.Склад.ФизическийСклад);
		запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		РезультатЗапроса = Запрос.Выполнить(); 
		
		РезПроверки.Успех =  РезультатЗапроса.Пустой();
		
		МассивТоваровБлок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");  
		РезПроверки.Ошибки = МассивТоваровБлок; 
		
		Возврат РезПроверки; 
 
		
КонецФункции // ПроверитьЗНБОжиданиеНабора()

 //++Данилова Е.В. 24.02.2026 HELP-8893 
 Функция РазделитьЗНБ(СоответствиеНомерЧастиТовары,РНК) Экспорт
    РезультатВыполнения = МаркировкаКС.СтруктураРезультата(Ложь); 

 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланНабора.Ссылка КАК Ссылка,
		|	ПланНаборатБрэндов.Коллекция.ЭтоГруппа КАК КоллекцияЭтоГруппа
		|ИЗ
		|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
		|		ПО ПланНаборатБрэндов.Ссылка = ПланНабора.Ссылка
		|ГДЕ
		|	ПланНабора.Проведен
		|	И ПланНабора.Накладная = &Накладная";
	
	Запрос.УстановитьПараметр("Накладная", РНК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		ПланНабора = ВыборкаДетальныеЗаписи.ссылка; 
		
		ЗаполнениеПоБрендам = ВыборкаДетальныеЗаписи.КоллекцияЭтоГруппа; 
		НачатьТранзакцию(); 
		ПланНабораОбъект = ПланНабора.ПолучитьОбъект(); 
		
		ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(РНК);
		РаспределятьРасходныеМатериалы = Ложь; 	
		если ДопПараметрыНакладной.НаборыЧЗбезОклейкиКомплектующих или ДопПараметрыНакладной.ОтгрузкаFBS тогда
			РаспределятьРасходныеМатериалы=Истина;
		КонецЕсли;
		
		ЗаблокированныеТовары  = Новый ТаблицаЗначений;
		ЗаблокированныеТовары.Колонки.Добавить("номенклатура", Новый ОписаниеТипов("СправочникСсылка.номенклатура"));
		ЗаблокированныеТовары.Колонки.Добавить("Коллекция",Новый ОписаниеТипов("СправочникСсылка.номенклатура"));
		
		
		Если ЗаполнениеПоБрендам  Тогда   		
			
			тБрэндов = ПланНабора.тБрэндов.Выгрузить(); 
			тБрэндов.Колонки.Добавить("Разделять"); 		 
			МассивЧастей = Новый Массив; 
			Для каждого СтрокаБрэнда Из тБрэндов Цикл
				
				ТоварыДляРазделения = СоответствиеНомерЧастиТовары.Получить(СтрокаБрэнда.номерЧасти);
				
				Если ТоварыДляРазделения <> Неопределено  Тогда
					МассивЧастей.Добавить(СтрокаБрэнда.номерЧасти);	
					СтрокаБрэнда.Разделять = истина;
					Для каждого ТовМассива Из ТоварыДляРазделения Цикл
						Если ТовМассива.Родитель.Родитель = СтрокаБрэнда.Коллекция Тогда 
							НоваяСтр = ЗаблокированныеТовары.Добавить(); 
							новаяСтр.Номенклатура =	ТовМассива; 
							новаяСтр.Коллекция = СтрокаБрэнда.Коллекция;
							//	
							//	СтрокаБрэнда.Разделять = истина;
							//Иначе 
							//	СтрокаБрэнда.Разделять = Ложь;
						КонецЕсли;
					КонецЦикла;	
					
				Иначе 
					СтрокаБрэнда.Разделять = Ложь;
				КонецЕсли;
			КонецЦикла; 
			
			ДанныеДляРазделения = Новый Структура("тБрэндов,ТоварыДляПереноса",тБрэндов,ЗаблокированныеТовары);
			ПланНабораОбъект.ЗаполнитьТаблицуБрэндов(РаспределятьРасходныеМатериалы,ДанныеДляРазделения);
			ПланНабораОбъект.Записать();
			
			ДанныеДляРазделения = Новый Структура("НомераЧастей,ТоварыДляПереноса",МассивЧастей,ЗаблокированныеТовары); 
			НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ = ложь; 
			РезультатСоздания = ПланНабораОбъект.СоздатьЗаданияНабораПоПлануНабора(РаспределятьРасходныеМатериалы,ДанныеДляРазделения,НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ);
			Если РезультатСоздания
				И НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ Тогда
				
				Если ТранзакцияАктивна() Тогда
					
					ЗафиксироватьТранзакцию();
					
				КонецЕсли;
				
				
				СоздатьЗНМ_И_ЛМ_ПоЗНБ_Набора(ПланНабораОбъект.ссылка,РНК); 	
			Иначе 
				
				Если ТранзакцияАктивна() Тогда
					
					ЗафиксироватьТранзакцию();
					
				КонецЕсли;
				
			КонецЕсли;
			РезультатВыполнения.Успешно =  РезультатСоздания;
			РезультатВыполнения.Данные = ПланНабораОбъект.ссылка;
			
			Если Не РезультатСоздания Тогда
				
				РезультатВыполнения.Ошибки.Добавить("Не удалось записать ЗНБ");	
				
			КонецЕсли;
		Иначе 	
			
			ЗаблокированныеТоварыМассив = Новый Массив;
			МассивЧастей = Новый Массив;
			Для каждого  ЭлементСоответствия Из СоответствиеНомерЧастиТовары  Цикл
				МассивЧастей.Добавить(ЭлементСоответствия.Ключ);
				Для каждого ТоварИзМассива Из ЭлементСоответствия.Значение  Цикл
					
					ЗаблокированныеТоварыМассив.Добавить(ТоварИзМассива); 					
					
					НоваяСтр = ЗаблокированныеТовары.Добавить(); 
					новаяСтр.Номенклатура =	ТоварИзМассива; 
					новаяСтр.Коллекция = ТоварИзМассива;
				КонецЦикла;  			
				
			КонецЦикла;
			
			тБрэндов = ПланНабора.тБрэндов.Выгрузить();
			тБрэндов.Колонки.Добавить("Разделять");  		
			
			Для каждого СтрокаБрэнда Из тБрэндов Цикл
				
				ТоварыДляРазделения = СоответствиеНомерЧастиТовары.Получить(СтрокаБрэнда.номерЧасти);
				
				Если ТоварыДляРазделения <> Неопределено  Тогда  
					
					СтрокаБрэнда.Разделять = истина; 
					
				Иначе 
					СтрокаБрэнда.Разделять = Ложь;
				КонецЕсли;
			КонецЦикла; 
			
			ДанныеДляРазделения = Новый Структура("тБрэндов,ТоварыДляПереноса",тБрэндов,ЗаблокированныеТоварыМассив); 			
			ПланНабораОбъект.ЗаполнитьТаблицуБрэндовШарапово(ДанныеДляРазделения);
			//ПланНабораОбъект.тБрэндов.Сортировать("ЭтоБлочки,Брэнд"); 
			ПланНабораОбъект.Записать();
			ДанныеДляРазделения = Новый Структура("НомераЧастей,ТоварыДляПереноса",МассивЧастей,ЗаблокированныеТовары);
			НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ = Ложь; 
			РезультатСоздания = ПланНабораОбъект.СоздатьЗаданияНабораПоПлануНабора(РаспределятьРасходныеМатериалы,ДанныеДляРазделения,НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ);
			
			Если РезультатСоздания
				И НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ Тогда
				
				Если ТранзакцияАктивна() Тогда
					
					ЗафиксироватьТранзакцию();
					
				КонецЕсли;
				
				СоздатьЗНМ_И_ЛМ_ПоЗНБ_Набора(ПланНабораОбъект.ссылка,РНК); 	
			Иначе 
				
				Если ТранзакцияАктивна() Тогда
					
					ЗафиксироватьТранзакцию();
					
				КонецЕсли;	
			КонецЕсли;
			РезультатВыполнения.Успешно =  РезультатСоздания;  
			РезультатВыполнения.Данные = ПланНабораОбъект.ссылка; 
			Если Не РезультатСоздания Тогда
				
				РезультатВыполнения.Ошибки.Добавить("Не удалось записать ЗНБ");	
				
			КонецЕсли;
		КонецЕсли;
		
		
		Возврат РезультатВыполнения;
	Иначе 
		
		//Сообщить("Не найден план набора по РНК"); 
		РезультатВыполнения.Ошибки.Добавить("Не найден план набора по РНК"); 
		Возврат РезультатВыполнения; 
	КонецЕсли;

 
КонецФункции

Процедура СоздатьЗНМ_И_ЛМ_ПоЗНБ_Набора(Знач ПланНабора, Знач Накладная)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНабора.Ссылка КАК ЗНБ
	               |ИЗ
	               |	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	               |ГДЕ
	               |	ЗаданиеНабора.ДокументОснование = &ДокументОснование
	               |	И ЗаданиеНабора.Проведен
	               |	И ЗаданиеНабора.ТребуетсяМаркировка
	               |	И ЗаданиеНабора.Дата >= &Дата
	               |	И ЗаданиеНабора.ЗНМ = ЗНАЧЕНИЕ(Документ.ЗаданиеНаМаркировку.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ПланНабора);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаРедактирования.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ошибки = Документы.ЗаданиеНабора.СоздатьЗНМ_И_ЛМ(Выборка.ЗНБ, Накладная);
		
		Если ЗначениеЗаполнено(Ошибки) Тогда
			
			Сообщить(Ошибки);
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
 
 //--Данилова Е.В. 24.02.2026  
 //++Данилова Е.В. 11.03.2026  SNL-159 
 Функция ЗНБПоПроходнойНакладной(Знач ЗНБ) Экспорт
 
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
		|		ПО ЗаданиеНабора.ДокументОснование = ПланНабора.Ссылка
		|ГДЕ
		|	ЗаданиеНабора.Ссылка = &Ссылка
		|	И ПланНабора.ПроходнаяНакладная
		|	И ПланНабора.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", ЗНБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат  НЕ РезультатЗапроса.Пустой(); 

 
 КонецФункции // ЗНБПоПроходнойНакладной()
  Функция ПроходнаяНакладнаяПроверкаРНК(Знач РНК) Экспорт
 
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПланНабора КАК ПланНабора
		|ГДЕ
		|	ПланНабора.ПроходнаяНакладная
		|	И ПланНабора.Накладная = &Накладная
		|	И ПланНабора.Проведен";
	
	Запрос.УстановитьПараметр("Накладная", РНК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат  НЕ РезультатЗапроса.Пустой(); 

 
 КонецФункции
 //--Данилова Е.В. 11.03.2026
